In [1]:
import pandas as pd
import numpy as np
import re

# para pintar
import pylab as plt
import seaborn as sns

#para que salga el grafico
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')  # esto es para quitar prints

pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

# OBSERVACIÓN Y LIMPIEZA DE DATOS

In [2]:
actor=pd.read_csv(r'../data/actor.csv')

In [3]:
category=pd.read_csv(r'../data/category.csv')

In [4]:
film=pd.read_csv(r'../data/film.csv')

In [5]:
inventory=pd.read_csv(r'../data/inventory.csv')

In [6]:
language=pd.read_csv(r'../data/language.csv')

In [7]:
oldHDD=pd.read_csv(r'../data/old_HDD.csv')

In [8]:
rental=pd.read_csv(r'../data/rental.csv')

## Tabla actor

In [9]:
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [10]:
actor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

In [11]:
actor.last_update.unique()

array(['2006-02-15 04:34:33'], dtype=object)

En la tabla actor, no hya nulos y la fecha de actualización es una constante y no nos da info, por lo que elimino esa columna

In [12]:
actor.drop(['last_update'], axis = 1, inplace= True)

In [13]:
actor.drop_duplicates(subset = ['first_name', 'last_name']).shape==actor.shape

False

Comprobamos duplicados y vemos que hya un nombre-apellido duplicado

In [14]:
actor['nombre_completo'] = actor.first_name + ' ' +actor.last_name

In [15]:
actor.head()

   actor_id first_name     last_name      nombre_completo
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

In [16]:
actor.nombre_completo.value_counts().head()

SUSAN DAVIS       2
EWAN GOODING      1
DARYL CRAWFORD    1
GRETA KEITEL      1
JANE JACKMAN      1
Name: nombre_completo, dtype: int64

In [17]:
actor.duplicated(subset = ['nombre_completo']).any()

True

In [18]:
actor[actor.nombre_completo == 'SUSAN DAVIS']

     actor_id first_name last_name nombre_completo
100       101      SUSAN     DAVIS     SUSAN DAVIS
109       110      SUSAN     DAVIS     SUSAN DAVIS

Vemos que la actriz duplicada es SUSAN DAVIS, como tienen diferntes ID, vamos a ver si el resto de tablas nos pueden dar más información. De momento asumimos que son actices diferentes, y lodejamos.

In [19]:
actor.head()

   actor_id first_name     last_name      nombre_completo
0         1   PENELOPE       GUINESS     PENELOPE GUINESS
1         2       NICK      WAHLBERG        NICK WAHLBERG
2         3         ED         CHASE             ED CHASE
3         4   JENNIFER         DAVIS       JENNIFER DAVIS
4         5     JOHNNY  LOLLOBRIGIDA  JOHNNY LOLLOBRIGIDA

## Tabla category

In [20]:
category

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [21]:
category.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

In [22]:
category.last_update.unique()

array(['2006-02-15 04:46:27'], dtype=object)

En la tabla category, no hay nulos y la fecha de actualización es una constante, por lo que elimino esa columna

In [23]:
category.drop(['last_update'], axis = 1, inplace= True)

In [24]:
category.head()

   category_id       name
0            1     Action
1            2  Animation
2            3   Children
3            4   Classics
4            5     Comedy

## Tabla film

In [25]:
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [26]:
film.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

In [27]:
language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [28]:
film.language_id.unique()

array([1], dtype=int64)

In [29]:
film.last_update.unique()

array(['2006-02-15 05:03:42'], dtype=object)

In [30]:
film.describe().T

,count,mean,std,min,25%,50%,75%,max
film_id,1000.0,500.500,288.819436,1.00,250.75,500.50,750.25,1000.00
release_year,1000.0,2006.000,0.000000,2006.00,2006.00,2006.00,2006.00,2006.00
language_id,1000.0,1.000,0.000000,1.00,1.00,1.00,1.00,1.00
original_language_id,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
rental_duration,1000.0,4.985,1.411654,3.00,4.00,5.00,6.00,7.00
rental_rate,1000.0,2.980,1.646393,0.99,0.99,2.99,4.99,4.99
length,1000.0,115.272,40.426332,46.00,80.00,114.00,149.25,185.00
replacement_cost,1000.0,19.984,6.050833,9.99,14.99,19.99,24.99,29.99

Con el describe, observamos que no hay ningún valor especialemnte atípico para cccada una de las columnas númericas que indican la duración de la peli, y los costes de alquiler, reposición y tiempo de alquiler.

In [31]:
film.release_year.unique()

array([2006], dtype=int64)

In [32]:
film.duplicated(subset = ['title']).any()

False

In [33]:
film.rating.value_counts()

PG-13    223
NC-17    210
R        195
PG       194
G        178
Name: rating, dtype: int64

Observando la tabla, he visto tres coolumnas que no aportaban información porque eran todos los valores iguales, ('last_update', 'release_year'). Y 'original_language_id' todo nulos. Elimino estas columnas.
La columna lenguage_ID también solo tenía un valor único pero la dejaremos para realcionarla con la tabla languages, pensando que un futuro se puedan añadir pelis en otros idiomas. 
También se ha comprobado que no hubiera ningún nombre de película

In [34]:
film.drop(['last_update', 'original_language_id', 'release_year'], axis = 1, inplace= True)

In [35]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes"
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes"
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes

## Tabla inventory

In [36]:
inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [37]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [38]:
inventory.last_update.unique()

array(['2006-02-15 05:09:17'], dtype=object)

En la tabla category, no hay nulos y la fecha de actualización es una constante, por lo que elimino esa columna

In [39]:
inventory.drop(['last_update'], axis = 1, inplace= True)

In [40]:
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

## Tabla language

In [41]:
language

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19
5            6    German  2006-02-15 05:02:19

In [42]:
language.drop(['last_update'], axis = 1, inplace= True)

In [43]:
language

   language_id      name
0            1   English
1            2   Italian
2            3  Japanese
3            4  Mandarin
4            5    French
5            6    German

## rental

In [44]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [45]:
rental.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

In [46]:
rental.duplicated(subset = ['rental_date','inventory_id', 'customer_id','return_date', 'staff_id']).any()

False

In [47]:
rental.drop(['last_update'], axis = 1, inplace= True)

In [48]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1

Como esta tabla contiene como columna inventory_id, se deduce que está tabla tendrá FOREIGN KEY de la tabla inventory
Obsevamos que hay valores de inventory_id que no están incluidos en la tabla inventory, por lo que estos valores no podrán ser añadidos a esta tabla, ya que no se puede alquilar algo que no esté en el inventario.

Por lo que hay dos posibles soluciones inventarnos en la tabla inventory_id registros con estos valores, o eliminarlos de esta tabla. 
Decido eliminarlos porque a efectos de construcción de la base de datos no va a influir, y no se puede saber de donde viene esta info, se asume que las tablas están incompletas.

In [49]:
rental = rental[rental.inventory_id < 1001]

In [50]:
rental.shape

(212, 6)

In [51]:
rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
15,16,2005-05-25 00:43:11,389,316,2005-05-26 04:42:11,2
16,17,2005-05-25 01:06:36,830,575,2005-05-27 00:43:36,1
20,21,2005-05-25 01:59:46,146,388,2005-05-26 01:01:46,2
21,22,2005-05-25 02:19:23,727,509,2005-05-26 04:52:23,2

## Tabla oldHDD

In [52]:
oldHDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [53]:
oldHDD.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

In [54]:
oldHDD.release_year.unique()

array([2006], dtype=int64)

In [55]:
oldHDD['nombre_completo'] = oldHDD.first_name + ' ' +oldHDD.last_name

In [56]:
oldHDD.head()

,first_name,last_name,title,release_year,category_id,nombre_completo
0,PENELOPE,GUINESS,ACADEMY DINOSAUR,2006,6,PENELOPE GUINESS
1,PENELOPE,GUINESS,ANACONDA CONFESSIONS,2006,2,PENELOPE GUINESS
2,PENELOPE,GUINESS,ANGELS LIFE,2006,13,PENELOPE GUINESS
3,PENELOPE,GUINESS,BULWORTH COMMANDMENTS,2006,10,PENELOPE GUINESS
4,PENELOPE,GUINESS,CHEAPER CLYDE,2006,14,PENELOPE GUINESS

In [57]:
oldHDD.duplicated(subset = ['nombre_completo', 'title']).any()

False

In [58]:
oldHDD[oldHDD['nombre_completo'] == 'SUSAN DAVIS']

Empty DataFrame
Columns: [first_name, last_name, title, release_year, category_id, nombre_completo]
Index: []

In [59]:
oldHDD.nombre_completo.unique()

array(['PENELOPE GUINESS', 'NICK WAHLBERG', 'ED CHASE', 'JENNIFER DAVIS',
       'JOHNNY LOLLOBRIGIDA', 'BETTE NICHOLSON', 'GRACE MOSTEL',
       'MATTHEW JOHANSSON', 'JOE SWANK', 'CHRISTIAN GABLE', 'ZERO CAGE',
       'KARL BERRY', 'UMA WOOD', 'VIVIEN BERGEN', 'CUBA OLIVIER',
       'FRED COSTNER', 'HELEN VOIGHT', 'DAN TORN', 'BOB FAWCETT',
       'LUCILLE TRACY', 'KIRSTEN PALTROW', 'ELVIS MARX', 'SANDRA KILMER',
       'CAMERON STREEP', 'KEVIN BLOOM', 'RIP CRAWFORD', 'JULIA MCQUEEN',
       'WOODY HOFFMAN', 'ALEC WAYNE', 'SANDRA PECK', 'SISSY SOBIESKI',
       'TIM HACKMAN', 'MILLA PECK', 'AUDREY OLIVIER', 'JUDY DEAN',
       'BURT DUKAKIS', 'VAL BOLGER', 'TOM MCKELLEN', 'GOLDIE BRODY'],
      dtype=object)

Esta tabla realciona las pelis con los actores y la categoría. Para hacerlo más efectivo me voy a traer los id de cada tabla y dejaremos solo estos campos para trabajar con ellos.
También he buscado a la actriz SUSAN DAVIS para ver si teníamos más información sobre ella, pero no aparece en esta tabla, por lo que las dejamos como dos actirces diferentes.

Como en el resto de tablas hay valores constantes que no nos aportan información, descartaré estas columnas.

In [60]:
df_temp=oldHDD.set_index('nombre_completo').join(actor.set_index('nombre_completo'), lsuffix='_HDD', rsuffix='_actor') # join 1

In [61]:
df_temp.head()

,first_name_HDD,last_name_HDD,title,release_year,category_id,actor_id,first_name_actor,last_name_actor
nombre_completo,,,,,,,,
ALEC WAYNE,ALEC,WAYNE,ALADDIN CALENDAR,2006,15,29,ALEC,WAYNE
ALEC WAYNE,ALEC,WAYNE,BLADE POLISH,2006,7,29,ALEC,WAYNE
ALEC WAYNE,ALEC,WAYNE,BULL SHAWSHANK,2006,1,29,ALEC,WAYNE
ALEC WAYNE,ALEC,WAYNE,CABIN FLASH,2006,3,29,ALEC,WAYNE
ALEC WAYNE,ALEC,WAYNE,CENTER DINOSAUR,2006,4,29,ALEC,WAYNE

In [62]:
df_temp = df_temp[['actor_id', 'title', 'release_year', 'category_id']]

In [63]:
df_temp.head()

                 actor_id             title  release_year  category_id
nombre_completo
ALEC WAYNE             29  ALADDIN CALENDAR          2006           15
ALEC WAYNE             29      BLADE POLISH          2006            7
ALEC WAYNE             29    BULL SHAWSHANK          2006            1
ALEC WAYNE             29       CABIN FLASH          2006            3
ALEC WAYNE             29   CENTER DINOSAUR          2006            4

In [64]:
df_temp2 = df_temp.join(film[['film_id','title']].set_index('title'), on= 'title', lsuffix='_HDD', rsuffix='_film') #join 2

In [65]:
df_temp2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, ALEC WAYNE to ZERO CAGE
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   actor_id      1000 non-null   int64
 1   title         1000 non-null   object
 2   release_year  1000 non-null   int64
 3   category_id   1000 non-null   int64
 4   film_id       1000 non-null   int64
dtypes: int64(4), object(1)
memory usage: 46.9+ KB

In [66]:
df_temp2.reset_index(inplace = True)

In [67]:
df_temp2.head()

,nombre_completo,actor_id,title,release_year,category_id,film_id
0,ALEC WAYNE,29,ALADDIN CALENDAR,2006,15,10
1,ALEC WAYNE,29,BLADE POLISH,2006,7,79
2,ALEC WAYNE,29,BULL SHAWSHANK,2006,1,105
3,ALEC WAYNE,29,CABIN FLASH,2006,3,110
4,ALEC WAYNE,29,CENTER DINOSAUR,2006,4,131

In [68]:
len(df_temp2)

1000

In [69]:
old_HDD = df_temp2[['actor_id', 'film_id', 'category_id']]

In [70]:
old_HDD.head()

   actor_id  film_id  category_id
0        29       10           15
1        29       79            7
2        29      105            1
3        29      110            3
4        29      131            4

Como la category_id solo hace referencia a las pelis, no tiene sentido que esté en esta tabla, paso este codigo a la tabla film

In [71]:
len(old_HDD.film_id.unique())

614

In [72]:
film_category = old_HDD[['film_id','category_id']].drop_duplicates()

In [73]:
film_category.shape

(614, 2)

In [74]:
film_category.head()

   film_id  category_id
0       10           15
1       79            7
2      105            1
3      110            3
4      131            4

In [75]:
film = film.join(film_category.set_index('film_id'), on= 'film_id', lsuffix='_HDD', rsuffix='_film')

In [76]:
film.head()

,film_id,title,description,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,category_id
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",6.0
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",11.0
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",6.0
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",NaN
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,1,6,2.99,130,22.99,G,Deleted Scenes,NaN

In [77]:
old_HDD.drop(['category_id'], axis = 1, inplace= True)

In [78]:
old_HDD.head()

   actor_id  film_id
0        29       10
1        29       79
2        29      105
3        29      110
4        29      131

Tenía pendiente una columna en la tabla actor que hemos utilizado pero no la queremos en la base de datos porque duplica info

In [79]:
actor.drop(['nombre_completo'], axis = 1, inplace= True)

In [80]:
actor.head()

   actor_id first_name     last_name
0         1   PENELOPE       GUINESS
1         2       NICK      WAHLBERG
2         3         ED         CHASE
3         4   JENNIFER         DAVIS
4         5     JOHNNY  LOLLOBRIGIDA

YA ESTáN TODAS LAS TABLAS LISTAS PARA SER IMPORTADAS EN LA BASE DE DATOS.
Se crea la base de datos con la interfaz de mySQL WorkBench

# INSERTAR DATOS

Se incluye toda la info de los Data Frame en la base de datos.

In [81]:
%pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in c:\users\aaron\anaconda3\lib\site-packages (1.4.32)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\aaron\anaconda3\lib\site-packages (from SQLAlchemy) (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [82]:
%pip install pymysql

Requirement already satisfied: pymysql in c:\users\aaron\anaconda3\lib\site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [83]:
from sqlalchemy import create_engine

str_conn='mysql+pymysql://root:ironhack@localhost:3306' #Conectar al servidor

cursor=create_engine(str_conn) #Cursor que apunta al servidor

# cursor.execute('drop database if exists videos;') #Lanzar query en el servidor, borra SCHEMA si existe

# cursor.execute('create database SCHEMA;') #Crear SCHEMA

str_conn='mysql+pymysql://root:ironhack@localhost:3306/videos' #Conexión a SCHEMA

cursor_db=create_engine(str_conn) #Cursor que apunta a SCHEMA

#DATAFRAME.to_sql(name='NOMBRE_DATAFRAME', con=cursor_db, if_exists='replace', index=False)

In [84]:
actor.to_sql(name='actores', con=cursor_db, if_exists='append', index=False)

200

In [85]:
category.to_sql(name='categories', con=cursor_db, if_exists='append', index=False)

16

In [86]:
language.to_sql(name='languages', con=cursor_db, if_exists='append', index=False)

6

In [87]:
film.to_sql(name='films', con=cursor_db, if_exists='append', index=False)

1000

In [88]:
old_HDD.to_sql(name='oldhdd', con=cursor_db, if_exists='append', index=False)

1000

In [89]:
inventory.to_sql(name='inventory', con=cursor_db, if_exists='append', index=False)

1000

In [90]:
rental.to_sql(name='rental', con=cursor_db, if_exists='append', index=False)

212